//\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ Цикл for

for (var i = 0; i < 10; i++) {
	// тіло циклу
	console.log(i);
}

for (
	['змінна циклу'];
	['умова продовження циклу'];
	['математична операція для змінної']
) {
	console.log('змінна циклу');
}

for (var i = 0; i < 10; i++) console.log(i);

let count = 0;
for (let i = 0; i < 10; i++) {
	count = count + 1;
}
console.log(count);

for (let i = 0; i < 3; i++) {
	alert(i);
}
// Виконати початок
// → (Якщо умова == true → Виконати тіло, Виконати крок)
// → (Якщо умова == true → Виконати тіло, Виконати крок)
// → (Якщо умова == true → Виконати тіло, Виконати крок)
// → (Якщо умова == false → Тіло не виконується і цикл зупиняється)

for (let i = 0; i < 3; i++) alert(i);

let i = 0;
/*Виконати початок */
/* Якщо умова == true → Виконати тіло, Виконати крок */
if (i < 3) {
	alert(i);
	i++;
}
/* Якщо умова == true → Виконати тіло, Виконати крок */
if (i < 3) {
	alert(i);
	i++;
}
/* Якщо умова == true → Виконати тіло, Виконати крок */
if (i < 3) {
	alert(i);
	i++;
}

for (let i = 0; i < 3; i++) {
	alert(i);
}
alert(i); // помилка, немає такої змінної

let i = 1;
for (i = 0; i < 3; i++) {
	console.log(i);
}
console.log(i + ' nice');

let i = 1;
for (; i <= 3; i++) {
	console.log(i);
}

let i = 1;
for (; i <= 3; ) {
	console.log(i++);
}

//\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ Цикл while
// використовується для виконання блоку коду, доки задана умова залишається істинною.

while (condition) {
	//code
	// математична дія для зміни "тіла циклу"
}

let i = 1;

while (i <= 3) {
	console.log(i);
	i++;
}

let i = 3;
while (i) {
	// коли і дорівнює 0, умова стане хибною, і цикл запиниться
	console.log(i);
	i--;
}

let bool = true;
let countt = 0;
while (bool) {
	// ітурації виконуються бо умова є true
	console.log(countt); //Виводимо значення count в консоль для більшої наглядності
	countt++; // збільшує count на 1
	if (countt === 10) {
		//додаємо умову при яку ми поговоримо в наступних уроках
		bool = false;
		// Якщо в одній із ітерацій спрацює умова count === 10, тоді ми змінюємо наш bool на false
	}
}

//\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ Цикл do while

do {
	//Тіло циклу
} while (condition);

let x = 13;
do {
	//Виконається перша ітерація у будь-якому випадку
	x--;
	console.log(x);
} while (x > 10); //Потім спрацьовує перша перевірка умови в нашому випадку вона false)

//\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ Оператори для роботи в циклах

for (var i = 0; i <= 10; i++) {
	if (i === 5) {
		console.log('Зупинка на i = 5!');
		break;
	}
	console.log(i);
}

for (var i = 0; i <= 5; i++) {
	if (i === 3) {
		//Якщо і === 3 виконається ця умова з оператором continue

		console.log('Пропуск значення 3!');
		continue;
	}
	console.log(i);
}

//Створення потягу із 1000 вагонів
let train = []; //Створюємо пустий масив (наш майбутній потяг)
for (let i = 1; i <= 1000; i++) {
	// вже відомий нам цикл з умовою i <= 1000
	train.push('Вагон ' + i); // Цей метод додає об'єкт в масив (в нашому випадку string)
}
console.log(train); //Виводимо в консоль наш зібраний потяг із 1000
