//\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ Конструкція if

if ('Вираз') 'інструкція';

if ('умова') {
	// команди тут будуть виконані тільки якщо умова істина
}

('Приклад 1');
// Запишимо число 7 змінну а
var a = 7;
// Запишимо число 7 змінну b
var b = 7;
// Перевіримо чи дорівнюють ці числа один одному
if (a == b) {
	// Якщо числа збігаються виведемо "Числа збігаються"
	console.log('Числа збігаються');
}

('або');
if (a === b) console.log('Числа збігаються');

('Приклад 2');
if (true) {
	return 'спрацював перший return';
}
return 'general';

//\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ Інструкція if..else

if ('умова') {
	// Команди тут будуть виконані тільки якщо умова істина
} else {
	// Команди тут будуть виконані тільки якщ умова хибна
}

('Приклад 1');
// Запишемо число 10 змінну а
var a = 10;
// Запишемо число 7 змінну b
var b = 7;
// Перевіримо чи збігаються числа
if (a == b) {
	// У разі якщо числа збігаються вивидоми "Числа збігаються"
	console.log('Числа збігаються');
} else {
	// У разі якщо числа не збігаються виводимо "Числа не збігаються"
	console.log('Числа не збігаються');
}

//\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ Конструкція else if

if ('Умова_1') {
	// Команди розташовані тут будуть виконані тільки якщо Умова_1 істинна
} else if ('Умова_2') {
	// Команди розташовані тут будуть виконані тільки якщо Умова_2 істинна
} else if ('Умова_N') {
	// Команди розташовані тут будуть виконані тільки якщо Умова_N істинна
} else {
	// Команди розташовані тут будуть виконані якщо жодна з умов вище не була істинною
}

('Приклад 1');
var a = 10,
	b = 10;
if (a == b) {
	console.log('a == b');
} else if (a <= b) {
	console.log('a <= b');
} else {
	console.log('a > b ');
}

//\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ Інструкція switch

// Інструкція switch використовується в багатьох мовах програмування, включаючи JavaScript, для зручного порівняння значень однієї змінної зі списком можливих значень та виконання відповідного блоку коду, щойно відповідне значення знайдено.

switch ('Вираз') {
	case 'Вираз':
		'інструкція';
	case 'Вираз':
		'інструкція';
	case 'Вираз':
		'інструкція';
	default:
		'інструкція';
}
// Використовуйте цю інструкцію, якщо хочете, щоб за певної умови (відповідності) команди виконалися лише в одному з кількох блоків.

var x = 10;
var j = 10;
var n = 10;
switch (x) {
	case n:
		// Команди цього блоку будуть виконані, якщо х = n;
		console.log('x = n');
		break;
	case j:
		// Команди цього блоку будуть виконані, якщо х = j;
		console.log('x = j');
		break;
	default:
		//Команди цього блоку будуть виконані якщо х не дорівнює n, t, i, j, etc.
		console.log('x не дорівнює n, t, i, j, etc');
}

('Приклад 1');
/* Визначаємо сьогоднішній день (Понеділок = 1, Середа = 3, Субота = 6, Неділя = 0 і т.д.) */
let date = new Date();
let day = date.getDay();
/* І залежно від цього виводимо повідомлення */
switch (day) {
	case 6:
		document.write('<h2>' + 'Сьогодні вихідний!' + '</h2>');
		break;
	case 0:
		document.write('<h2>' + 'Сьогодні вихідний!' + '</h2>');
		break;
	default:
		document.write('<h2>' + 'Сьогодні вам потрібно йти на роботу...' + '</h2>');
}

//\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ Перевірка декількох виразів в одній умові

// && (логічне "І" або "AND"):
var a = 10;
var b = 9;
if (a != b && a > b) {
	// Код буде виконано якщо і перша і друга умова виявляться вірними
	console.log('всі умови виконані');
}

// || (логічне "АБО" або "OR"):
var a = 9;
var b = 10;
if (a != b || a > b) {
	// Код буде виконано якщо і перша і друга умова виявляться вірними
	console.log('якась з умов виконана');
}

//\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ Тернарний оператор

// text_вираз ? вираз_one : вираз_two

// (умова) ? вираз_якщо_істина : вираз_якщо_умова_хибна;

// Цей оператор перевіряє умову. Якщо умова істинна, виконується вираз після ?; якщо умова хибна, виконується вираз після :.

('Приклад 1');
let a = 5;
let b = 10;

let rresult = a > b ? 'a більше b' : 'a не більше b';

console.log(rresult);

('Моя ідея');
let a = 9;
let b = 10;

const check = (a, b) =>
	a > b ? 'a більше b' : 'виконалась умова ' + check(a + b, b);

let result = check(a, b);
console.log(result);

let m = 'milk';
let f = 'fish';

const x = prompt('оберіть рецепт з fish or milk');
switch (x) {
	case f:
		alert('рецепт з рибою');
		break;
	case m:
		alert('рецепт з молоком');
		break;
	default:
		alert('введено невірний варіант');
}
